In [ ]:
## SQL (STRUCTURED QUERY LANGUAGE)

import sqlite3

#connecting with the database (if there is no database exists, it will create one)

#anyname=sqlite3.connect("database_name.db(extension)")

data = sqlite3.connect("student_detail.db")

In [ ]:
# To Declare Cursor: if we are writing in a databse then we must declare or create cursor to specify the position where we wanna write.

#anyname= filename.cursor

cursor = data.cursor()

In [8]:
# To Create Table:

cursor.execute("CREATE TABLE student_infor(roll_no INT,email_id TEXT ,course_name TEXT,fee_paid INT)")

# here INT & TEXT are particular datatypes  ,means vkues must be of ame datatype mentioned and PRIMARY KEY mean unique value.

In [9]:
# To insert records into the table using INSERT INTO & VALUES: order should be samein values.

cursor.execute("INSERT INTO student_infor(roll_no,email_id ,course_name,fee_paid) VALUES (10,'stu1@gmail.com', 'ds', 45000)")

In [11]:
# to save the record permanently use .commit , it don't use then will not see records next time
#databsename.commit

data.commit()

In [12]:
# count of records inserted:

print(cursor.rowcount,'Record(s) inserted')

1 Record(s) inserted

In [13]:
# SELECT QUERY : to fatch records from the Table using SELECT:
# here we used a results(any_name) just bcoz to store details in a different variable. 
# (*) is ued to select all the data.

results = cursor.execute("SELECT*FROM student_infor")
for row in results:   # for loop is for all the rows one by one(or on loop)
    print(row)

(10, 'stu1@gmail.com', 'ds', 45000)

In [14]:
# MULTIPLE RECORDS INSERTION: here we don't need to define column name again , just proceed with VALUES separated by comma.

cursor.execute("INSERT INTO student_infor VALUES(11,'stu2@gmail.com','ds',54000),(12 ,'stu3@gmail.com','dbms',56000)")
data.commit()

In [15]:
# count of rows inserted:

print(cursor.rowcount,'Record(s) inserted')

2 Record(s) inserted

In [16]:
results=cursor.execute("SELECT * FROM student_infor")
for row in results:
    print(row)

(10, 'stu1@gmail.com', 'ds', 45000)
(11, 'stu2@gmail.com', 'ds', 54000)
(12, 'stu3@gmail.com', 'dbms', 56000)

In [17]:
# HOW TO LOAD DATA FROM FILE INTO TABLE: we here load /insert data from csv file to table

# NOTE : keep csv file in the same folder where your jupyter notebook is present or provide folder link , you can't directly
#open file directly from GitHub , if in diff. folder the copy the pAth of filemand paste it here.

# we have to use 'with open' to open any file with extension , and 'r' is for read only , we can't write anything.

#as file means we don't need to wtite file name everytime just write file further.

with open('studentt.csv','r') as file:   
    no_records=0
    for row in file:
        cursor.execute("INSERT INTO student_infor VALUES (?,?,?,?)", row.split(","))
        data.commit()
        no_records+=1
    
print(no_records,'Record(s) inserted')

8 Record(s) inserted

In [18]:
results=cursor.execute("SELECT * FROM student_infor")
for row in results:
    print(row)

(10, 'stu1@gmail.com', 'ds', 45000)
(11, 'stu2@gmail.com', 'ds', 54000)
(12, 'stu3@gmail.com', 'dbms', 56000)
(14, 'stu4@gmail.com', 'digital m', 47000)
(15, 'stu5@gmail.com', 'digital m', 56000)
(16, 'stu6@gmail.com', 'dbms', 120000)
(17, 'stu7@gmail.com', 'ds', 45000)
(18, 'stu8@gmail.com', 'dbms', 47500)
(19, 'stu9@gmail.com', 'digital m', 56100)
(20, 'stu10@gmail.com', 'ds', 25500)
(21, 'stu11@gmail.com', 'dbms', 74000)

In [19]:
# WHERE CLAUSE : Fatch/Select records based on condition and (*) is for all the data with WHERE.

# here again , we will define a new varaible to fatch some records from table/fatabse so just not to confuse.

sqll = "SELECT * FROM student_infor WHERE course_name='ds'"
result=cursor.execute(sqll)   # fatch result in sql
for row in results:
    print(row)
    
    #similarly we can fatch other records using WHERE CLAUSE.

(10, 'stu1@gmail.com', 'ds', 45000)
(11, 'stu2@gmail.com', 'ds', 54000)
(17, 'stu7@gmail.com', 'ds', 45000)
(20, 'stu10@gmail.com', 'ds', 25500)

In [20]:
#DELETE Records : deleteunwanted records using DELETE FROM

sqll= "DELETE FROM student_infor WHERE roll_no=11"
cursor.execute(sqll)
data.commit()    # we must commit as we are changing the data.

In [21]:
# To Verify:

sqll="SELECT * FROM student_infor"

result=cursor.execute(sqll)
for row in result:
    print(row)
    
    #here roll_no 11 all detail/rows is deleted.

(10, 'stu1@gmail.com', 'ds', 45000)
(12, 'stu3@gmail.com', 'dbms', 56000)
(14, 'stu4@gmail.com', 'digital m', 47000)
(15, 'stu5@gmail.com', 'digital m', 56000)
(16, 'stu6@gmail.com', 'dbms', 120000)
(17, 'stu7@gmail.com', 'ds', 45000)
(18, 'stu8@gmail.com', 'dbms', 47500)
(19, 'stu9@gmail.com', 'digital m', 56100)
(20, 'stu10@gmail.com', 'ds', 25500)
(21, 'stu11@gmail.com', 'dbms', 74000)

In [22]:
# ORDER BY : to fatch the details in order or change the data in order using ORDER BY:

result=cursor.execute("SELECT * FROM student_infor ORDER BY fee_paid")
for row in result:
    print(row)
    
    # by deafault it order in ascending order.

(20, 'stu10@gmail.com', 'ds', 25500)
(10, 'stu1@gmail.com', 'ds', 45000)
(17, 'stu7@gmail.com', 'ds', 45000)
(14, 'stu4@gmail.com', 'digital m', 47000)
(18, 'stu8@gmail.com', 'dbms', 47500)
(12, 'stu3@gmail.com', 'dbms', 56000)
(15, 'stu5@gmail.com', 'digital m', 56000)
(19, 'stu9@gmail.com', 'digital m', 56100)
(21, 'stu11@gmail.com', 'dbms', 74000)
(16, 'stu6@gmail.com', 'dbms', 120000)

In [23]:
# ORDER BY in descending: use 'desc'

result = cursor.execute("SELECT * FROM student_infor ORDER BY fee_paid desc")
for row in result:
    print(row)

(16, 'stu6@gmail.com', 'dbms', 120000)
(21, 'stu11@gmail.com', 'dbms', 74000)
(19, 'stu9@gmail.com', 'digital m', 56100)
(12, 'stu3@gmail.com', 'dbms', 56000)
(15, 'stu5@gmail.com', 'digital m', 56000)
(18, 'stu8@gmail.com', 'dbms', 47500)
(14, 'stu4@gmail.com', 'digital m', 47000)
(10, 'stu1@gmail.com', 'ds', 45000)
(17, 'stu7@gmail.com', 'ds', 45000)
(20, 'stu10@gmail.com', 'ds', 25500)

In [24]:
result=cursor.execute("SELECT * FROM student_infor ORDER BY course_name")
for row in result:
    print(row)
    
    # by deafault it order in ascending order. also for alphabetical

(12, 'stu3@gmail.com', 'dbms', 56000)
(16, 'stu6@gmail.com', 'dbms', 120000)
(18, 'stu8@gmail.com', 'dbms', 47500)
(21, 'stu11@gmail.com', 'dbms', 74000)
(14, 'stu4@gmail.com', 'digital m', 47000)
(15, 'stu5@gmail.com', 'digital m', 56000)
(19, 'stu9@gmail.com', 'digital m', 56100)
(10, 'stu1@gmail.com', 'ds', 45000)
(17, 'stu7@gmail.com', 'ds', 45000)
(20, 'stu10@gmail.com', 'ds', 25500)

In [25]:
result=cursor.execute("SELECT * FROM student_infor ORDER BY course_name desc")
for row in result:
    print(row)
    
    # by deafault it order in ascending order. also for alphabetical

(10, 'stu1@gmail.com', 'ds', 45000)
(17, 'stu7@gmail.com', 'ds', 45000)
(20, 'stu10@gmail.com', 'ds', 25500)
(14, 'stu4@gmail.com', 'digital m', 47000)
(15, 'stu5@gmail.com', 'digital m', 56000)
(19, 'stu9@gmail.com', 'digital m', 56100)
(12, 'stu3@gmail.com', 'dbms', 56000)
(16, 'stu6@gmail.com', 'dbms', 120000)
(18, 'stu8@gmail.com', 'dbms', 47500)
(21, 'stu11@gmail.com', 'dbms', 74000)

In [26]:
#UPDATE TABLE : update the column using UPDATE , SET(which column we want to update) & WHERE (only for particular condition)

sqll = "UPDATE student_infor SET course_name ='ds' WHERE roll_no=14 "
cursor.execute(sqll)

In [27]:
# check if course name updated or not

sqll = "SELECT * FROM student_infor WHERE roll_no=14"
result = cursor.execute(sqll)
for row in result:
        print(row)
        
        # there is no need to commit in UPDATE as we are just updating the existing record.
        # similarly we can update using other condition

(14, 'stu4@gmail.com', 'ds', 47000)

# MULTIPLE CONDITIONS:

sqll = "SELECT email_id , fee_paid FROM student_infor WHERE course_name='ds' AND fee_paid> 20000"
result = cursor.execute(sqll)
for row in result:
    print(row)

In [30]:
sqll = "UPDATE student_infor SET fee_paid = 100000 WHERE fee_paid IN (45000,54000)"
cursor.execute(sqll)

In [34]:
# Verify if it is updated or not , we wll just verify fee_paid column

result=cursor.execute("SELECT fee_paid FROM student_infor WHERE fee_paid IN(45000,54000)")
for row in result:
    print(row)

In [35]:
# Update records in between parTicular range using BETWEEN:

sqll = "UPDATE student_infor SET course_name='Python' WHERE roll_no BETWEEN 17 AND 21"   #here we are just updating
cursor.execute(sqll)

In [38]:
# verify it it is updated:

sqll = cursor.execute("SELECT roll_no , course_name FROM student_infor WHERE course_name='Python'")
for row in result:
    print(row)

(17, 'Python')
(18, 'Python')
(19, 'Python')
(20, 'Python')
(21, 'Python')

## MIN & MAX

In [40]:
result=cursor.execute("SELECT MIN(fee_paid) FROM student_infor")
print('Minimum fees=',result.fetchone())    #fetchone means it will only give least/max fee only one.

result=cursor.execute("SELECT Max(fee_paid) FROM student_infor")
print('Maximum fees=',result.fetchone())

Minimum fees= (25500,)
Maximum fees= (120000,)

## SUBQUERY: